In [ ]:
#40. Importing Data Into Python

In [1]:
import pandas as pd

In [ ]:
#Method 1: Specify Full Path To File

In [2]:
#Windows:
stats = pd.read_csv('C:\\Users\\shimi\\OneDrive\\Documents\\Udemy\\Udemy_Python-For-Data-Science\\Python A-Z™ - Python For Data Science With Real Exercises!\\05 - Data Frames\\P4-Demographic-Data.csv')
#stats = pd.read_csv('P4-Demographic-Data.csv')

In [ ]:
stats

In [ ]:
#Method 2: Change Working Directory

In [3]:
import os

In [4]:
print(os.getcwd())

C:\Users\shimi\OneDrive\Documents\Udemy\Udemy_Python-For-Data-Science\Python A-Z™ - Python For Data Science With Real Exercises!\05 - Data Frames

In [ ]:
#Windows
#os.chdir('C:\\Users\\shimi\\OneDrive\\Área de Trabalho')  #Changing of working directory
os.chdir('C:\\Users\\shimi\\OneDrive\\Documents\\Udemy\\Udemy_Python-For-Data-Science\\Python A-Z™ - Python For Data Science With Real Exercises!\\05 - Data Frames')

In [ ]:
stats2 = pd.read_csv('P4-Demographic-Data.csv')

In [ ]:
stats2

In [ ]:
#41. Exploring your dataset

In [ ]:
#1. Full dataframe
stats

In [ ]:
#2. Number of rows
len(stats) #195 rows imported

In [ ]:
#3. See columns
stats.columns

In [ ]:
#4. Number of columns
len(stats.columns)

In [ ]:
#5. Top rows
stats.head(6) #remember the parentheses

In [ ]:
#6. Bottom rows
stats.tail(6)

In [ ]:
#7. Information on the columns
stats.info() #like the str() function in R

In [ ]:
#8. Get stats on the columns
stats.describe() #like summary() in R

In [ ]:
stats.describe().transpose()

In [ ]:
#42. Renaming Columns of a Dataframe

In [ ]:
stats.head()

In [ ]:
stats.columns

In [6]:
stats.columns = ['CountryName', 'CountryCode', 'BirthRate', 'InternetUsers', 'IncomeGroup']

In [ ]:
#43. Subsetting Data Frames in Pandas

In [ ]:
stats.head()

In [ ]:
#Three parts
# -Rows
# -Columns
# -Combine the two

In [ ]:
#Part 1. Rows

stats[2:4]

In [ ]:
#Quick exercise (refresher)
#Reverse the data frame

stats[::-1]

In [ ]:
#Quick exercise (refresher)
#Get ONLY every 20th row

stats[::20]

In [ ]:
#Part 2. Columns

In [ ]:
stats['CountryName'].head()

In [ ]:
stats[['BirthRate', 'CountryName']].head()

#In R you'd be passing a Vector: c('CountryName', 'BirthRate')

In [ ]:
#Quick Acces - requires the name to be one word

In [ ]:
stats.BirthRate.head()

In [ ]:
#Part 3. Combine the two

In [ ]:
stats[4:8][['BirthRate', 'CountryName']]

In [ ]:
stats[['CountryName', 'BirthRate']][4:8]

In [ ]:
#Two subsettings are being made

In [ ]:
df1 = stats[4:8]
df1[['CountryName', 'BirthRate']]

In [ ]:
df2 = stats[['CountryName', 'BirthRate']]
df2[4:8]

In [ ]:
#44. Basic Operations with a Data Frame

In [ ]:
stats[['CountryName', 'BirthRate', 'InternetUsers']][3:9]

In [7]:
#Mathematical operations:

result = stats.BirthRate * stats.InternetUsers
result.head()

0    808.2516
1    207.9927
2    878.3135
3    736.5644
4    971.8720
dtype: float64

In [8]:
#Add column:

stats['MyCalc'] = result
stats.head()

,CountryName,CountryCode,BirthRate,InternetUsers,IncomeGroup,MyCalc
0,Aruba,ABW,10.244,78.9,High income,808.2516
1,Afghanistan,AFG,35.253,5.9,Low income,207.9927
2,Angola,AGO,45.985,19.1,Upper middle income,878.3135
3,Albania,ALB,12.877,57.2,Upper middle income,736.5644
4,United Arab Emirates,ARE,11.044,88.0,High income,971.8720

In [9]:
#Comparison to R:
#stats['xyz'] = [1, 2, 3, 4, 5] #Error. No recycling option

stats['xyz'] = list(range(0, 195))
stats.head()

,CountryName,CountryCode,BirthRate,InternetUsers,IncomeGroup,MyCalc,xyz
0,Aruba,ABW,10.244,78.9,High income,808.2516,0
1,Afghanistan,AFG,35.253,5.9,Low income,207.9927,1
2,Angola,AGO,45.985,19.1,Upper middle income,878.3135,2
3,Albania,ALB,12.877,57.2,Upper middle income,736.5644,3
4,United Arab Emirates,ARE,11.044,88.0,High income,971.8720,4

In [13]:
#Removing a column

stats = stats.drop(['MyCalc', 'xyz'], axis=1)

In [14]:
stats.head()

,CountryName,CountryCode,BirthRate,InternetUsers,IncomeGroup
0,Aruba,ABW,10.244,78.9,High income
1,Afghanistan,AFG,35.253,5.9,Low income
2,Angola,AGO,45.985,19.1,Upper middle income
3,Albania,ALB,12.877,57.2,Upper middle income
4,United Arab Emirates,ARE,11.044,88.0,High income